<script setup>
import FaqItem from '/src/components/faq/FaqItem.vue'

const responseData = [
  {
    question: 'Вы помогаете с трансфером из аэропорта?',
    answer: 'Да, в нашей клинике можно приобрести солнцезащитные очки с диоптриями под заказ. Для этого Вам нужно записаться на прием к врачу для выписки рецепта на очки. Приём у врача проходит по предварительной записи. Или если у Вас есть рецепт, то просто подойти в наш салон для заказа.\n' +
        'Срок ожидания заказа до 1 месяца.\n' +
        'Салон  оптики при нашей клиники работает без выходных с 09:00 до 20:00, прием у врача начинается с 10 часов.\n',
  },
  {
    question: 'Могу ли я записать своего родственника, друга?',
    answer: 'Да, в нашей клинике можно приобрести солнцезащитные очки с диоптриями под заказ. Для этого Вам нужно записаться на прием к врачу для выписки рецепта на очки. Приём у врача проходит по предварительной записи. Или если у Вас есть рецепт, то просто подойти в наш салон для заказа.\n' +
        'Срок ожидания заказа до 1 месяца.\n' +
        'Салон  оптики при нашей клиники работает без выходных с 09:00 до 20:00, прием у врача начинается с 10 часов.\n',
  },
  {
    question: 'В какой валюте происходит оплата услуг?',
    answer: 'Да, в нашей клинике можно приобрести солнцезащитные очки с диоптриями под заказ. Для этого Вам нужно записаться на прием к врачу для выписки рецепта на очки. Приём у врача проходит по предварительной записи. Или если у Вас есть рецепт, то просто подойти в наш салон для заказа.\n' +
        'Срок ожидания заказа до 1 месяца.\n' +
        'Салон  оптики при нашей клиники работает без выходных с 09:00 до 20:00, прием у врача начинается с 10 часов.\n',
  },
  {
    question: 'Действуют ли в клинике скидки ветеранам труда, труженникам тыла?',
    answer: 'Да, в нашей клинике можно приобрести солнцезащитные очки с диоптриями под заказ. Для этого Вам нужно записаться на прием к врачу для выписки рецепта на очки. Приём у врача проходит по предварительной записи. Или если у Вас есть рецепт, то просто подойти в наш салон для заказа.\n' +
        'Срок ожидания заказа до 1 месяца.\n' +
        'Салон  оптики при нашей клиники работает без выходных с 09:00 до 20:00, прием у врача начинается с 10 часов.\n',
  },
  {
    question: 'У моей матери на одном глазу поставили диагноз катаракта,на другом глоукома.Сколько будут стоить операции с данными проблемами.Ветеран труда.Существуют ли какие-то льготы?',
    answer: 'Да, в нашей клинике можно приобрести солнцезащитные очки с диоптриями под заказ. Для этого Вам нужно записаться на прием к врачу для выписки рецепта на очки. Приём у врача проходит по предварительной записи. Или если у Вас есть рецепт, то просто подойти в наш салон для заказа.\n' +
        'Срок ожидания заказа до 1 месяца.\n' +
        'Салон  оптики при нашей клиники работает без выходных с 09:00 до 20:00, прием у врача начинается с 10 часов.\n',
  },
  {
    question: 'Есть ли эффективные народные методы лечения варикоцеле?',
    answer: 'Да, в нашей клинике можно приобрести солнцезащитные очки с диоптриями под заказ. Для этого Вам нужно записаться на прием к врачу для выписки рецепта на очки. Приём у врача проходит по предварительной записи. Или если у Вас есть рецепт, то просто подойти в наш салон для заказа.\n' +
        'Срок ожидания заказа до 1 месяца.\n' +
        'Салон  оптики при нашей клиники работает без выходных с 09:00 до 20:00, прием у врача начинается с 10 часов.\n',
  },
]

</script>

<template>
  <div class="faq container-offset">
    <h1 class="faq_header">Часто задаваемые вопросы</h1>
    <div class="faq_content">
      <div class="faq_content_item" v-for="item in responseData">
        <FaqItem v-bind:item="item"/>
      </div>
    </div>
  </div>
</template>

<style scoped>

.faq {
  display: flex;
  flex-direction: column;
  gap: 24px;
}

.faq_header {
  color: var(--Text-Heading);
  font-size: 40px;
  font-weight: 700;
  letter-spacing: -0.8px;
  display: flex;
  justify-content: space-between;
}

.faq_content {
  display: flex;
  flex-direction: column;
  gap: 12px;
}

.faq_content_item {
  display: flex;
  flex-direction: column;
  gap: 12px;
}

</style>
