<script setup>
import {ref} from 'vue'

const action = ref(false)
const responseData = [
  {
    question: 'Вы помогаете с трансфером из аэропорта?',
    answer: 'Да, в нашей клинике можно приобрести солнцезащитные очки с диоптриями под заказ. Для этого Вам нужно записаться на прием к врачу для выписки рецепта на очки. Приём у врача проходит по предварительной записи. Или если у Вас есть рецепт, то просто подойти в наш салон для заказа.\n' +
        'Срок ожидания заказа до 1 месяца.\n' +
        'Салон  оптики при нашей клиники работает без выходных с 09:00 до 20:00, прием у врача начинается с 10 часов.\n',
  },
  {
    question: 'Могу ли я записать своего родственника, друга?',
    answer: 'Да, в нашей клинике можно приобрести солнцезащитные очки с диоптриями под заказ. Для этого Вам нужно записаться на прием к врачу для выписки рецепта на очки. Приём у врача проходит по предварительной записи. Или если у Вас есть рецепт, то просто подойти в наш салон для заказа.\n' +
        'Срок ожидания заказа до 1 месяца.\n' +
        'Салон  оптики при нашей клиники работает без выходных с 09:00 до 20:00, прием у врача начинается с 10 часов.\n',
  },
  {
    question: 'В какой валюте происходит оплата услуг?',
    answer: 'Да, в нашей клинике можно приобрести солнцезащитные очки с диоптриями под заказ. Для этого Вам нужно записаться на прием к врачу для выписки рецепта на очки. Приём у врача проходит по предварительной записи. Или если у Вас есть рецепт, то просто подойти в наш салон для заказа.\n' +
        'Срок ожидания заказа до 1 месяца.\n' +
        'Салон  оптики при нашей клиники работает без выходных с 09:00 до 20:00, прием у врача начинается с 10 часов.\n',
  },
  {
    question: 'Действуют ли в клинике скидки ветеранам труда, труженникам тыла?',
    answer: 'Да, в нашей клинике можно приобрести солнцезащитные очки с диоптриями под заказ. Для этого Вам нужно записаться на прием к врачу для выписки рецепта на очки. Приём у врача проходит по предварительной записи. Или если у Вас есть рецепт, то просто подойти в наш салон для заказа.\n' +
        'Срок ожидания заказа до 1 месяца.\n' +
        'Салон  оптики при нашей клиники работает без выходных с 09:00 до 20:00, прием у врача начинается с 10 часов.\n',
  },
  {
    question: 'У моей матери на одном глазу поставили диагноз катаракта,на другом глоукома.Сколько будут стоить операции с данными проблемами.Ветеран труда.Существуют ли какие-то льготы?',
    answer: 'Да, в нашей клинике можно приобрести солнцезащитные очки с диоптриями под заказ. Для этого Вам нужно записаться на прием к врачу для выписки рецепта на очки. Приём у врача проходит по предварительной записи. Или если у Вас есть рецепт, то просто подойти в наш салон для заказа.\n' +
        'Срок ожидания заказа до 1 месяца.\n' +
        'Салон  оптики при нашей клиники работает без выходных с 09:00 до 20:00, прием у врача начинается с 10 часов.\n',
  },
  {
    question: 'Есть ли эффективные народные методы лечения варикоцеле?',
    answer: 'Да, в нашей клинике можно приобрести солнцезащитные очки с диоптриями под заказ. Для этого Вам нужно записаться на прием к врачу для выписки рецепта на очки. Приём у врача проходит по предварительной записи. Или если у Вас есть рецепт, то просто подойти в наш салон для заказа.\n' +
        'Срок ожидания заказа до 1 месяца.\n' +
        'Салон  оптики при нашей клиники работает без выходных с 09:00 до 20:00, прием у врача начинается с 10 часов.\n',
  },
]
const handleOpen = () => {
  action.value = !action.value;
}
</script>

<template>
  <div class="faq container-offset">
    <h1 class="faq_header">Часто задаваемые вопросы</h1>
    <div class="faq_content">

      <div class="faq_content_item" v-for="item in responseData">
        <div class="faq_content_item_subtitle-wrapper" :class="action ? 'open' : 'close'" @click="handleOpen">
          <strong class="faq_content_item_subtitle">{{item.question}}</strong>
        </div>
        <p class="faq_content_item_text" :class=" action ? 'text-open' : 'text-close'">
          {{ item.answer}}
        </p>
      </div>

    </div>
  </div>
</template>

<style scoped>

.faq {
  display: flex;
  flex-direction: column;
  gap: 24px;
}

.faq_header {
  color: var(--Text-Heading);
  font-size: 40px;
  font-weight: 700;
  letter-spacing: -0.8px;
  display: flex;
  justify-content: space-between;
}

.faq_content {
  display: flex;
  flex-direction: column;
  gap: 12px;
}

.faq_content_item {
  display: flex;
  flex-direction: column;
  gap: 12px;
}

.faq_content_item_subtitle-wrapper {
  border-radius: 12px;
  padding: 20px;
  display: flex;
  gap: 8px;
  cursor: pointer;
}

.faq_content_item_subtitle-wrapper:before {
  content: '';
  display: list-item;
  List-style-type: decimal;
  font-size: 16px;
  font-weight: 500;
  margin-left: 20px;
}

.faq_content_item_subtitle-wrapper:after {
  display: block;
  content: '';
  width: 18px;
  height: 18px;
}

.open {
  background: var(--Primary);
  color: var(--White);
}

.close {
  background: rgba(229, 236, 240, 0.50);
  color: var(--Black);
}

.close:after {
  background-image: url("data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' width='18' height='19' viewBox='0 0 18 19' fill='none'%3E%3Cg clip-path='url(%23clip0_342_1855)'%3E%3Cpath d='M16.3929 8.2161H10.9286C10.7511 8.2161 10.6071 8.07218 10.6071 7.89467V2.43038C10.6071 1.54285 9.88754 0.823242 9 0.823242C8.11246 0.823242 7.39286 1.54285 7.39286 2.43038V7.89467C7.39286 8.07218 7.24894 8.2161 7.07143 8.2161H1.60714C0.719604 8.2161 0 8.9357 0 9.82324C0 10.7108 0.719604 11.4304 1.60714 11.4304H7.07143C7.24894 11.4304 7.39286 11.5743 7.39286 11.7518V17.2161C7.39286 18.1036 8.11246 18.8232 9 18.8232C9.88754 18.8232 10.6071 18.1036 10.6071 17.2161V11.7518C10.6071 11.5743 10.7511 11.4304 10.9286 11.4304H16.3929C17.2804 11.4304 18 10.7108 18 9.82324C18 8.9357 17.2804 8.2161 16.3929 8.2161Z' fill='%235AA9D4'/%3E%3C/g%3E%3Cdefs%3E%3CclipPath id='clip0_342_1855'%3E%3Crect width='18' height='18' fill='white' transform='translate(0 0.823242)'/%3E%3C/clipPath%3E%3C/defs%3E%3C/svg%3E");
}

.open:after {
  background-image: url("data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' width='18' height='19' viewBox='0 0 18 19' fill='none'%3E%3Cg clip-path='url(%23clip0_342_1855)'%3E%3Cpath d='M16.3929 8.2161H10.9286C10.7511 8.2161 10.6071 8.07218 10.6071 7.89467V2.43038C10.6071 1.54285 9.88754 0.823242 9 0.823242C8.11246 0.823242 7.39286 1.54285 7.39286 2.43038V7.89467C7.39286 8.07218 7.24894 8.2161 7.07143 8.2161H1.60714C0.719604 8.2161 0 8.9357 0 9.82324C0 10.7108 0.719604 11.4304 1.60714 11.4304H7.07143C7.24894 11.4304 7.39286 11.5743 7.39286 11.7518V17.2161C7.39286 18.1036 8.11246 18.8232 9 18.8232C9.88754 18.8232 10.6071 18.1036 10.6071 17.2161V11.7518C10.6071 11.5743 10.7511 11.4304 10.9286 11.4304H16.3929C17.2804 11.4304 18 10.7108 18 9.82324C18 8.9357 17.2804 8.2161 16.3929 8.2161Z' fill='%23fff'/%3E%3C/g%3E%3Cdefs%3E%3CclipPath id='clip0_342_1855'%3E%3Crect width='18' height='18' fill='white' transform='translate(0 0.823242)'/%3E%3C/clipPath%3E%3C/defs%3E%3C/svg%3E");
  transform: rotate(45deg);
}

.faq_content_item_subtitle {
  font-size: 16px;
  font-weight: 500;
  display: flex;
  justify-content: space-between;
  align-items: center;
  width: 100%;
}

.faq_content_item_text {
  color: var(--Black);
  font-size: 16px;
  line-height: 24px;
  padding: 30px 20px;
  box-shadow: 3px 3px 20px 0 rgba(90, 169, 213, 0.15);
}

.text-open {
  display: block;
}

.text-close {
  display: none;
}

</style>
